; domain
(define (domain taxi-planner)
  (:requirements :strips :typing)
  (:types taxi passenger location)
  (:predicates
    (at ?v - taxi ?l - location)
    (passenger-at ?p - passenger ?l - location)
    (in-taxi ?p - passenger ?v - taxi)
    (station ?l - location)
  )
  (:action move
    :parameters (?v - taxi ?from - location ?to - location)
    :precondition (at ?v ?from)
    :effect (and (not (at ?v ?from)) (at ?v ?to))
  )
  (:action pickup
    :parameters (?v - taxi ?p - passenger ?l - location)
    :precondition (and (at ?v ?l) (passenger-at ?p ?l))
    :effect (and (not (passenger-at ?p ?l)) (in-taxi ?p ?v))
  )
  (:action dropoff
    :parameters (?v - taxi ?p - passenger ?l - location)
    :precondition (and (at ?v ?l) (in-taxi ?p ?v) (station ?l))
    :effect (and (not (in-taxi ?p ?v)) (passenger-at ?p ?l))
  )
)

; problem
(define (problem taxi-case4)
  (:domain taxi-planner)
  (:objects
    taxi1 taxi2 - taxi
    p1 p2 p3 p4 p5 p6 p7 p8 p9 - passenger
    st l1 l2 l3 l4 l5 l6 l7 l8 l9 - location
  )
  (:init
    (station st)
    (at taxi1 st)
    (at taxi2 st)
    (passenger-at p1 l1)
    (passenger-at p2 l2)
    (passenger-at p3 l3)
    (passenger-at p4 l4)
    (passenger-at p5 l5)
    (passenger-at p6 l6)
    (passenger-at p7 l7)
    (passenger-at p8 l8)
    (passenger-at p9 l9)
  )
  (:goal (and
    (passenger-at p1 st)
    (passenger-at p2 st)
    (passenger-at p3 st)
    (passenger-at p4 st)
    (passenger-at p5 st)
    (passenger-at p6 st)
    (passenger-at p7 st)
    (passenger-at p8 st)
    (passenger-at p9 st)
  ))
)

; plan
1. (move taxi2 st l1)
   deleted: (at taxi2 st)
   added: (at taxi2 l1)
   goals met: 0 of 9
2. (pickup taxi2 p1 l1)
   deleted: (passenger-at p1 l1)
   added: (in-taxi p1 taxi2)
   goals met: 0 of 9
3. (move taxi2 l1 l2)
   deleted: (at taxi2 l1)
   added: (at taxi2 l2)
   goals met: 0 of 9
4. (pickup taxi2 p2 l2)
   deleted: (passenger-at p2 l2)
   added: (in-taxi p2 taxi2)
   goals met: 0 of 9
5. (move taxi2 l2 l3)
   deleted: (at taxi2 l2)
   added: (at taxi2 l3)
   goals met: 0 of 9
6. (pickup taxi2 p3 l3)
   deleted: (passenger-at p3 l3)
   added: (in-taxi p3 taxi2)
   goals met: 0 of 9
7. (move taxi2 l3 l4)
   deleted: (at taxi2 l3)
   added: (at taxi2 l4)
   goals met: 0 of 9
8. (pickup taxi2 p4 l4)
   deleted: (passenger-at p4 l4)
   added: (in-taxi p4 taxi2)
   goals met: 0 of 9
9. (move taxi2 l4 l5)
   deleted: (at taxi2 l4)
   added: (at taxi2 l5)
   goals met: 0 of 9
10. (pickup taxi2 p5 l5)
   deleted: (passenger-at p5 l5)
   added: (in-taxi p5 taxi2)
   goals met: 0 of 9
11. (move taxi2 l5 l6)
   deleted: (at taxi2 l5)
   added: (at taxi2 l6)
   goals met: 0 of 9
12. (pickup taxi2 p6 l6)
   deleted: (passenger-at p6 l6)
   added: (in-taxi p6 taxi2)
   goals met: 0 of 9
13. (move taxi2 l6 l7)
   deleted: (at taxi2 l6)
   added: (at taxi2 l7)
   goals met: 0 of 9
14. (pickup taxi2 p7 l7)
   deleted: (passenger-at p7 l7)
   added: (in-taxi p7 taxi2)
   goals met: 0 of 9
15. (move taxi2 l7 l8)
   deleted: (at taxi2 l7)
   added: (at taxi2 l8)
   goals met: 0 of 9
16. (pickup taxi2 p8 l8)
   deleted: (passenger-at p8 l8)
   added: (in-taxi p8 taxi2)
   goals met: 0 of 9
17. (move taxi2 l8 l9)
   deleted: (at taxi2 l8)
   added: (at taxi2 l9)
   goals met: 0 of 9
18. (pickup taxi2 p9 l9)
   deleted: (passenger-at p9 l9)
   added: (in-taxi p9 taxi2)
   goals met: 0 of 9
19. (move taxi2 l9 st)
   deleted: (at taxi2 l9)
   added: (at taxi2 st)
   goals met: 0 of 9
20. (dropoff taxi2 p9 st)
   deleted: (in-taxi p9 taxi2)
   added: (passenger-at p9 st)
   goals met: 1 of 9
21. (dropoff taxi2 p8 st)
   deleted: (in-taxi p8 taxi2)
   added: (passenger-at p8 st)
   goals met: 2 of 9
22. (dropoff taxi2 p7 st)
   deleted: (in-taxi p7 taxi2)
   added: (passenger-at p7 st)
   goals met: 3 of 9
23. (dropoff taxi2 p6 st)
   deleted: (in-taxi p6 taxi2)
   added: (passenger-at p6 st)
   goals met: 4 of 9
24. (dropoff taxi2 p5 st)
   deleted: (in-taxi p5 taxi2)
   added: (passenger-at p5 st)
   goals met: 5 of 9
25. (dropoff taxi2 p4 st)
   deleted: (in-taxi p4 taxi2)
   added: (passenger-at p4 st)
   goals met: 6 of 9
26. (dropoff taxi2 p3 st)
   deleted: (in-taxi p3 taxi2)
   added: (passenger-at p3 st)
   goals met: 7 of 9
27. (dropoff taxi2 p2 st)
   deleted: (in-taxi p2 taxi2)
   added: (passenger-at p2 st)
   goals met: 8 of 9
28. (dropoff taxi2 p1 st)
   deleted: (in-taxi p1 taxi2)
   added: (passenger-at p1 st)
   goals met: 9 of 9
